namespace _014LongestCommonPrefix
{
    /*Напишите функцию для поиска самого длинного общего префикса среди массива строк.

    Если общего префикса нет, верните пустую строку "".

    Пример 1:

        Input: strs = ["flower","flow","flight"]
        Output: "fl"
    Пример 2:

        Input: strs = ["dog","racecar","car"]
        Output: ""
        Объяснение: Среди входных строк нет общего префикса.
      Ограничения:

            1 <= strs.length <= 200
            0 <= strs[i].length <= 200
       strs[i] состоит только из строчных букв английского алфавита.*/

    internal class Program
    {


        static void Main ( string[ ] args )
        {
            Console.WriteLine( "Hello, World!" );
        }
    }
}
